# Задана натуральная степень k. Сформировать случайным образом список коэффициентов (значения от 0 до 100)* многочлена и записать в файл многочлен степени k.
#     *Пример:*
#     - k=2 => 2*x² + 4*x + 5 = 0 или x² + 5 = 0 или 10*x² = 0
#     -  k=5 => 2*x^5 + 2*x^4 + 2*x^3 + 2*x^2 + 4*x + 5 = 0
import random
k = random.randint(0, 100)
i = k
n = ''
while i >= 0:
    if i == 0:
        n += '5 = 0'
    elif i == 1:
        n += '4*x + '
    else:
        n += f'2*x^{i} + '
    i -= 1
print(n)
with open('ex4_file.txt', 'w') as data:
    data.write(n)
